In [1]:
import mysql.connector  		#importing database
database = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database = "pythonclass8am"
)
db = database.cursor()

In [10]:
# Reading from database
sql = "SELECT * FROM student"
db.execute(sql)
result =db.fetchall()
for x in result:
    print(x)

(1, 'Ram Narayan', 78, 89, 78, 90, 72, 412)
(2, 'Rama', 78, 89, 78, 90, 72, 412)
(3, 'Harry', 70, 89, 78, 90, 72, 412)
(4, 'Hari', 78, 98, 67, 76, 89, 408)

In [11]:
# Reading from database
data = []
sql = "SELECT * FROM student"
db.execute(sql)
result =db.fetchall()
for x in result:
    data.append(x)
    
data

[(1, 'Ram Narayan', 78, 89, 78, 90, 72, 412),
 (2, 'Rama', 78, 89, 78, 90, 72, 412),
 (3, 'Harry', 70, 89, 78, 90, 72, 412),
 (4, 'Hari', 78, 98, 67, 76, 89, 408)]

In [12]:
# Reading from database
data = []
sql = "SELECT sn,name,total FROM student"
db.execute(sql)
result =db.fetchall()
for x in result:
    data.append(x)
    
data

[(1, 'Ram Narayan', 412),
 (2, 'Rama', 412),
 (3, 'Harry', 412),
 (4, 'Hari', 408)]

In [14]:
# Insert data in database

sql = '''INSERT INTO student (name,physics,chemistry,math,english,nepali,total) 
VALUES('Nabin',89,98,67,78,67,400)'''
db.execute(sql)
database.commit()

In [ ]:
n = int(input("Enter n = "))
for i in range(n):
    name = input("Enter name = ")
    physics = int(input("Enter physics marks = "))
    chemistry = int(input("Enter chemistry = "))
    math = int(input("Enter math marks = "))
    english = int(input("Enter english = "))
    nepali = int(input("Enter nepali marks = "))

    total = physics + chemistry + math + english + nepali
    sql = f"INSERT INTO student (name,physics,chemistry,math,english,nepali,total) VALUES('{name}',{physics},{chemistry},{math},{english},{nepali},{total})"
    db.execute(sql)
database.commit()

In [2]:
sql = "UPDATE student SET name = 'Rose' WHERE sn = 3"
db.execute(sql)
database.commit()

In [7]:
name = input("Enter name = ")
sn = int(input("Enter SN = "))
total = int(input("Enter grade = "))
sql = f"UPDATE student SET name = '{name}',total = '{total}' WHERE sn = {sn}"
print(sql)
db.execute(sql)
database.commit()

Enter name = Ram
Enter SN = 1
Enter grade = 400
UPDATE student SET name = 'Ram',total = '400' WHERE sn = 1

In [8]:
# Reading from database
sql = "SELECT * FROM student"
db.execute(sql)
result =db.fetchall()
for x in result:
    print(x)

(1, 'Ram', 78, 89, 78, 90, 72, 400)
(2, 'Jack', 78, 89, 78, 90, 72, 412)
(3, 'Rose', 70, 89, 78, 90, 72, 412)
(4, 'Hari', 78, 98, 67, 76, 89, 408)
(5, 'Nabin', 89, 98, 67, 78, 67, 400)

In [ ]:
# sql = "DELETE from student WHERE sn = 1"
# db.execute(sql)
# database.commit()

In [ ]:
# Input from user
# 1 for insert
# 2 for select
# 3 update
# 4 delete